leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.ADC.h
/*
 * S32K1xx.ADC.h
 *
 *  Created on: 2020年7月20日
 *      Author: Master.HE
 */

#ifndef S32K1XX_ADC_H_
#define S32K1XX_ADC_H_

#include "S32K1xx.Type.h"

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADCH									:6;
		__IO uint32_t AIEN									:1;
		__IO uint32_t COCO									:1;

		__IO uint32_t										:24;
	}BIT;
}ADC_SC1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADICLK								:2;
		__IO uint32_t MODE									:2;
		__IO uint32_t										:1;
		__IO uint32_t ADIV									:2;
		__IO uint32_t										:1;

		__IO uint32_t CLRLTRG								:1;
		__IO uint32_t										:23;
	}BIT;
}ADC_CFG1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t SMPLTS								:8;
		__IO uint32_t										:24;
	}BIT;
}ADC_CFG2_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t D										:12;
		__I  uint32_t										:20;
	}BIT;
}ADC_R_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CV									:16;
		__IO uint32_t										:16;
	}BIT;
}ADC_CV_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t REFSEL								:2;
		__IO uint32_t DMAEN									:1;
		__IO uint32_t ACREN									:1;
		__IO uint32_t ACFGT									:1;
		__IO uint32_t ACFE									:1;
		__IO uint32_t ADTRG									:1;
		__IO uint32_t ADACT									:1;

		__IO uint32_t										:5;
		__IO uint32_t TRGPRNUM								:2;
		__IO uint32_t										:1;

		__IO uint32_t TRGSTLAT								:4;
		__IO uint32_t										:4;

		__IO uint32_t TRGSTERR								:4;
		__IO uint32_t										:4;
	}BIT;
}ADC_SC2_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t AVGS									:2;
		__IO uint32_t AVGE									:1;
		__IO uint32_t ADCO									:1;
		__IO uint32_t										:2;
		__IO uint32_t										:1;
		__IO uint32_t CAL									:1;

		__IO uint32_t										:24;
	}BIT;
}ADC_SC3_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t BA_OFS								:8;
		__IO uint32_t										:24;
	}BIT;
}ADC_BASE_OFS_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t OFS									:16;
		__IO uint32_t										:16;
	}BIT;
}ADC_OFS_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADCH									:6;
		__IO uint32_t AIEN									:1;
		__IO uint32_t COCO									:1;

		__IO uint32_t										:24;
	}BIT;
}ADC_aSC1_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t D										:12;
		__I  uint32_t										:20;
	}BIT;
}ADC_aR_Type;



/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */


/** ADC - Size of Registers Arrays */
#define ADC_SC1_COUNT                            16u
#define ADC_R_COUNT                              16u
#define ADC_CV_COUNT                             2u

#if (defined (__Target_S32K146__))
#define ADC_aSC1_COUNT                           24u
#define ADC_aR_COUNT                             24u
#elif (defined (__Target_S32K148__))
#define ADC_aSC1_COUNT                           32u
#define ADC_aR_COUNT                             32u
#endif

/** ADC - Register Layout Typedef */
typedef struct
{
	ADC_SC1_Type SC1[ADC_SC1_COUNT];                /**< ADC Status and Control Register 1, array offset: 0x0, array step: 0x4 */
	ADC_CFG1_Type CFG1;                              /**< ADC Configuration Register 1, offset: 0x40 */
	ADC_CFG2_Type CFG2;                              /**< ADC Configuration Register 2, offset: 0x44 */
	ADC_R_Type R[ADC_R_COUNT];                    /**< ADC Data Result Registers, array offset: 0x48, array step: 0x4 */
	ADC_CV_Type CV[ADC_CV_COUNT];                  /**< Compare Value Registers, array offset: 0x88, array step: 0x4 */
	ADC_SC2_Type SC2;                               /**< Status and Control Register 2, offset: 0x90 */
	ADC_SC3_Type SC3;                               /**< Status and Control Register 3, offset: 0x94 */
	ADC_BASE_OFS_Type BASE_OFS;                          /**< BASE Offset Register, offset: 0x98 */
	ADC_OFS_Type OFS;                               /**< ADC Offset Correction Register, offset: 0x9C */
	__IO uint32_t USR_OFS;                           /**< USER Offset Correction Register, offset: 0xA0 */
	__IO uint32_t XOFS;                              /**< ADC X Offset Correction Register, offset: 0xA4 */
	__IO uint32_t YOFS;                              /**< ADC Y Offset Correction Register, offset: 0xA8 */
	__IO uint32_t G;                                 /**< ADC Gain Register, offset: 0xAC */
	__IO uint32_t UG;                                /**< ADC User Gain Register, offset: 0xB0 */
	__IO uint32_t CLPS;                              /**< ADC General Calibration Value Register S, offset: 0xB4 */
	__IO uint32_t CLP3;                              /**< ADC Plus-Side General Calibration Value Register 3, offset: 0xB8 */
	__IO uint32_t CLP2;                              /**< ADC Plus-Side General Calibration Value Register 2, offset: 0xBC */
	__IO uint32_t CLP1;                              /**< ADC Plus-Side General Calibration Value Register 1, offset: 0xC0 */
	__IO uint32_t CLP0;                              /**< ADC Plus-Side General Calibration Value Register 0, offset: 0xC4 */
	__IO uint32_t CLPX;                              /**< ADC Plus-Side General Calibration Value Register X, offset: 0xC8 */
	__IO uint32_t CLP9;                              /**< ADC Plus-Side General Calibration Value Register 9, offset: 0xCC */
	__IO uint32_t CLPS_OFS;                          /**< ADC General Calibration Offset Value Register S, offset: 0xD0 */
	__IO uint32_t CLP3_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 3, offset: 0xD4 */
	__IO uint32_t CLP2_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 2, offset: 0xD8 */
	__IO uint32_t CLP1_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 1, offset: 0xDC */
	__IO uint32_t CLP0_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 0, offset: 0xE0 */
	__IO uint32_t CLPX_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register X, offset: 0xE4 */
	__IO uint32_t CLP9_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 9, offset: 0xE8 */
#if (defined (__Target_S32K146__) || defined (__Target_S32K148__))
	uint8_t RESERVED_0[28];
	ADC_aSC1_Type aSC1[ADC_aSC1_COUNT];              /**< ADC Status and Control Register 1 (alias)..ADC Status and Control Register 1, array offset: 0x108, array step: 0x4 */
#if (defined (__Target_S32K146__))
	uint8_t RESERVED_1[32];
#endif
	ADC_aR_Type aR[ADC_aR_COUNT];                  /**< ADC Data Result Registers (alias)..ADC Data Result Registers, array offset: 0x188, array step: 0x4 */
#endif
} ADC_Type, *ADC_MemMapPtr;

 /** Number of instances of the ADC module. */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define ADC_INSTANCE_COUNT                       (1u)
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define ADC_INSTANCE_COUNT                       (2u)
#endif

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0x4003B000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
#if (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
/** Peripheral ADC1 base address */
#define ADC1_BASE                                (0x40027000u)
/** Peripheral ADC1 base pointer */
#define ADC1                                     ((ADC_Type *)ADC1_BASE)
#endif

